archive/before-2018-11-10/2018-03-07-syslog_tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>syslog tutorial</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">syslog tutorial</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3e1c962">1. hello world</a></li>
<li><a href="#org911ff9b">2. 自己根据syslog封装一个日志接口</a></li>
<li><a href="#orga453d2a">3. 配置远程日志服务器</a></li>
<li><a href="#org0ebbeb6">4. 配置syslog的格式</a></li>
<li><a href="#org7efaeeb">5. syglog, syslog-ng和rsyslog</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3e1c962" class="outline-2">
<h2 id="org3e1c962"><span class="section-number-2">1</span> hello world</h2>
<div class="outline-text-2" id="text-1">
<p>
ubuntu中确定syslogd进程运行着， <code>ubuntu 16.04</code> 中是叫 <code>rsyslog</code> ：
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;syslog.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;unistd.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;sys/types.h&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>()
{
    setlogmask (LOG_UPTO (LOG_NOTICE));
    openlog (<span style="color: #ff4ea3;">"exampleprog"</span>, LOG_CONS | LOG_PID | LOG_NDELAY, LOG_LOCAL1);

    syslog (LOG_NOTICE | LOG_FTP, <span style="color: #ff4ea3;">"[pengtest] Program started by User %d, with facility ftp."</span>, getuid ());

    syslog (LOG_NOTICE, <span style="color: #ff4ea3;">"Program started by User %d, with default facility."</span>, getuid ());

    syslog (LOG_INFO, <span style="color: #ff4ea3;">"A tree falls in a forest"</span>);
    closelog ();
    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>
<p>
执行后可以到 <code>/var/log/syslog</code> 文件中找到对应的打印。
</p>
</div>
</div>

<div id="outline-container-org911ff9b" class="outline-2">
<h2 id="org911ff9b"><span class="section-number-2">2</span> 自己根据syslog封装一个日志接口</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;syslog.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;unistd.h&gt;</span>
<span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;stdarg.h&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">my_log</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">level</span>, <span style="color: #a1db00;">const</span> <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">format</span>, ...)
{
    <span style="color: #00d7af;">va_list</span> <span style="color: #ff8700;">args</span>;
    va_start(args, format);
    vsyslog(level | LOG_LOCAL0, format, args);
    va_end(args);

    <span style="color: #a1db00;">return</span> 0;
}

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>()
{
    openlog (<span style="color: #ff4ea3;">"my_log"</span>, LOG_CONS | LOG_PID | LOG_NDELAY, LOG_LOCAL1);

        my_log(LOG_NOTICE, <span style="color: #ff4ea3;">"This is test,%d%s\n"</span>, 5, <span style="color: #ff4ea3;">"nihao"</span>);

    closelog ();
    <span style="color: #a1db00;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orga453d2a" class="outline-2">
<h2 id="orga453d2a"><span class="section-number-2">3</span> 配置远程日志服务器</h2>
<div class="outline-text-2" id="text-3">
<p>
假设当前有两台ubuntu机器，在日志server上需要开启rsyslog接收远程日志
的功能，具体做法是修改 <code>/etc/rsyslog.conf</code> 文件，保证有下面两行：
</p>
<div class="org-src-container">
<pre class="src src-conf-space"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">provides TCP syslog reception</span>
module(load=<span style="color: #ff4ea3;">"imtcp"</span>)
input(type=<span style="color: #ff4ea3;">"imtcp"</span> port=<span style="color: #ff4ea3;">"514"</span>)
</pre>
</div>

<p>
然后重启一下rsyslog服务 <code>sudo service rsyslog restart</code> 。
</p>

<p>
在日志的client上，直接指定rsyslog的远程server的ip和端口就可以了，比
如这样：
</p>
<div class="org-src-container">
<pre class="src src-conf-space"><span style="color: #ff8700;">*.*</span> @@10.0.0.50:514
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ebbeb6" class="outline-2">
<h2 id="org0ebbeb6"><span class="section-number-2">4</span> 配置syslog的格式</h2>
<div class="outline-text-2" id="text-4">
<p>
可以定义多种格式，然后使用即可，参考的 <a href="https://www.rsyslog.com/doc/v8-stable/configuration/templates.html">这里</a> ：
</p>
<div class="org-src-container">
<pre class="src src-conf-space"><span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#36825;&#31181;&#26159;&#26032;&#30340;&#26041;&#24335;&#26469;&#23450;&#20041;template&#30340;</span>
template(name=<span style="color: #ff4ea3;">"ForwardFormat"</span> type=<span style="color: #ff4ea3;">"list"</span>) {
    constant(value=<span style="color: #ff4ea3;">"&lt;"</span>)
    property(name=<span style="color: #ff4ea3;">"pri"</span>)
    constant(value=<span style="color: #ff4ea3;">"&gt;"</span>)
    property(name=<span style="color: #ff4ea3;">"timestamp"</span> dateFormat=<span style="color: #ff4ea3;">"rfc3339"</span>)
    constant(value=<span style="color: #ff4ea3;">" "</span>)
    property(name=<span style="color: #ff4ea3;">"hostname"</span>)
    constant(value=<span style="color: #ff4ea3;">" "</span>)
    property(name=<span style="color: #ff4ea3;">"syslogtag"</span> position.from=<span style="color: #ff4ea3;">"1"</span> position.to=<span style="color: #ff4ea3;">"32"</span>)
    property(name=<span style="color: #ff4ea3;">"msg"</span> spifno1stsp=<span style="color: #ff4ea3;">"on"</span> )
    property(name=<span style="color: #ff4ea3;">"msg"</span>)
    <span style="color: #ff8700;">}</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#26087;&#30340;&#26041;&#24335;&#26469;&#23450;&#20041;template</span>
<span style="color: #ff8700;">$template</span> myTraditionalFormatWithPRI,<span style="color: #ff4ea3;">"%pri-text%: %timegenerated% %HOSTNAME% %syslogtag%%msg:::drop-last-lf%\n"</span>

<span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#35774;&#32622;&#20026;&#23545;&#24212;&#30340;template&#30340;&#21517;&#23383;&#23601;&#21487;&#20197;&#20462;&#25913;&#20102;</span>
<span style="color: #ff8700;">$ActionFileDefaultTemplate</span> myTraditionalFormatWithPRI
</pre>
</div>

<p>
<a href="https://www.rsyslog.com/doc/master/configuration/properties.html">这里</a> 有 <code>syslog</code> 的所有property，可能参考来写template。
</p>
</div>
</div>

<div id="outline-container-org7efaeeb" class="outline-2">
<h2 id="org7efaeeb"><span class="section-number-2">5</span> syglog, syslog-ng和rsyslog</h2>
<div class="outline-text-2" id="text-5">
<p>
这三个其实都差不多。
</p>

<p>
<a href="https://serverfault.com/questions/692309/what-is-the-difference-between-syslog-rsyslog-and-syslog-ng">stackoverflow</a> 上有回答。
</p>

<p>
简单说，先有syslog，然后是syslog-ng然后是rsyslog。这三个并行在发展，
相互也进行参考。都差不多。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>